--breakºÍreturnÓï¾äÓÃÓÚ´Óµ±Ç°µÄÑ­»·½á¹¹ÖĞÌø³ö£¬gotoÓï¾äÔòÔÊĞíÌø×ªµ½º¯ÊıÖĞµÄ¼¸ºõÈÎºÎµØ·½
--ÎÒÃÇ¿ÉÒÔÊ¹ÓÃbreakÓï¾ä½áÊøÑ­»·£¬¸ÃÓï¾ä»áÖĞ¶Ï°üº¬ËüµÄÄÚ²ãÑ­»·(ÀıÈçfor repeat while)
--¸ÃÓï¾ä²»ÄÜÔÚÑ­»·ÍâÊ¹ÓÃ¡£breakÖĞ¶Ïºó ³ÌĞò»á½ô½Ó×Å±»ÖÕ¶ËµÄÑ­»·¼ÌĞøÖ´ĞĞ
--returnÓï¾äÓÃÓÚ·µ»Øº¯ÊıµÄÖ´ĞĞ½á¹û»ò¼òµ¥µØ½áÊøº¯ÊıµÄÔËĞĞ¡£ËùÓĞº¯ÊıµÄ×îºó¶¼ÓĞÒ»¸öÒşº¬µÄreturn
--Òò´ËÎÒÃÇ²»ĞèÒªÔÚÃ¿Ò»¸öÃ»ÓĞ·µ»ØÖµµÄº¯Êı×îºóÊéĞ´returnÓï¾ä
--°´ÕÕÓï·¨£¬returnÖ»ÄÜÊÇ´úÂë¿éµÄ×îºóÒ»¾ä£¬»»¾ä»°Ëµ£¬ËüÖ»ÄÜÊÇ´úÂë¿éµÄ×îºóÒ»¾ä£¬»òÕßÊÇend else untilÖ®Ç°µÄ×îºóÒ»¾ä
--return ÊÇ then´úÂëµÄ×îºóÒ»¾ä
local i=1
while a[i] do
 if a[i]==v then returni end
 i=i+1
end
--Í¨³£ÕâĞ©µØ·½ÕıÊ½Ê¹ÓÃreturnµÄµäĞÍÎ»ÖÃ£¬returnÖ®ºóµÄÓï¾ä²»»á±»Ö´ĞĞ
--²»¹ı£¬ÓĞÊ±ÔÚ´úÂë¿éÖĞ¼äÊ¹ÓÃreturnÒ²ÊÇºÜÓĞÓÃµÄ ÀıÈç ÔÚµ÷ÊÔÊ±ÎÒÃÇ¿ÉÄÜ²»ÏëÈÃÄ³¸öº¯ÊıÖ´ĞĞ
--
function foo()
 return
 do return end
 other statements
end

--gotoÓï¾äÓÃÓÚ½«µ±Ç°³ÌĞòÌø×ªµ½ÏàÓ¦µÄ±êÇ©³ö¼ÌĞøÖ´ĞĞ£¬gotoÓï¾äÒ»Ö±ÒÔÀ´±¸ÊÜÕùÒé
--ÖÁ½ñÈÔÓĞºÜ¶àÈËÈÏÎªËüÃÇ²»ÀûÓÚ³ÌĞò¿ª·¢²¢ÇÒÓ¦¸ÃÔÚ±à³ÌÓïÑÔÖĞ½ûÖ¹ ²»¹ı¾¡¹ÜÈç´Ë
--ÈÔÓĞºÜ¶àÓïÑÔ´¦ÓÚºÜ¶àÔ­Òò±£ÁôÁËgotoÓï¾ä gotoÓï¾äÓĞÇ¿´óµÄ¹¦ÄÜ
--ÔÚluaÖĞ£¬gotoÓï¾äµÄÓï·¨·Ç³£´«Í³ ¼´±£Áô×Ögoto ºóÃ
--½ô¸ú×Å±êÇ©Ãû£¬±êÇ©Ãû¿ÉÒÔÊÇÈÎÒâÓĞĞ§µÄ±êÊ¶·û ±êÇ©µÄÓï·¨ÉÔÎ¢ÓĞµã¸´ÔÓ ±êÇ©Ãû³ÆÇ°ºó¸÷½ô¸ú×ÅÁ½¸öÃ°ºÅ£¬ĞÎÈç::name::
--Õâ¸ö¸´ÔÓµÄÓï·¨¾ÍÊÇÓĞÒâ¶øÎªµÄ£¬Ö÷ÒªÊÇÎªÁËÔÚ³ÌĞòÖĞĞÑÄ¿µÄÍ»³öÕâĞ©±êÇ©
--Ê¹ÓÃ gotoÌø×ªÊ±£¬luaÉèÖÃÁËĞ©ÏŞÖÆ£¬Ê×ÏÈ ±êÇ©×ñÑ­³£¼ûµÄ¿É¼ûĞÔÔ­Ôò
--Òò´Ë²»ÄÜÖ±½ÓÌø×ªµ½Ò»¸ö´úÂë¿éÖĞµÄ±êÇ©(ÒòÎª´úÂë¿éÖĞµÄ±êÇ©¶ÔÍâ²»¿É¼û)
--goto²»ÄÜÌø×ªµ½¾Ö²¿±äÁ¿µÄ×÷ÓÃÓò
--¹ØÓÚgotoÓï¾äµäĞÍÇÒÕıÈ·µÄÊ¹ÓÃ·½Ê½£¬Çë²Î¿¼ÆäËûÒ»Ğ©±à³ÌÓïÑÔÖĞ´æÔÚµ«luaÖĞ²»´æÔÚµÄ´úÂë½á¹¹
--continue redo
--continueÓï¾ä½ö½öÏàµ±ÓÚÒ»¸öÌø×ªµ½Î»ÓÚÑ­»·Ìå×îºóÎ»ÖÃ´¦±êÇ©µÄgotoÓï¾ä ¶øredoÓï¾äÔòÏàµ±ÓÚÌø×ªµ½´úÂë¿é¿ªÊ¼Î»ÖÃµÄgotoÓï¾ä

while some_condition do
	::redo::
	if some_other_condition then goto continue
	elseif yet_another_condition then goto redo
	end
	some code
	::continue::
end
--luaÓïÑÔ¹æ·¶ÖĞÒ»¸öºÜÓĞÓÃµÄÏ¸½ÚÊÇ£¬¾Ö²¿±äÁ¿µÄ×÷ÓÃÓòÖÕÖ¹ÓÚÉùÃ÷±äÁ¿µÄ´úÂë¿éÖĞµÄ×îºóÒ»¸öÓĞĞ§(non-void)
--±êÇ©±»ÈÏÎªÊÇÎŞĞ§Óï¾ä
while some_condition do
 if some_other_condition then goto continue and
  local var =something
  some code
::continue::
end
--¶ÁÕß¿ÉÄÜÈÏÎª Õâ¸ögotoÓï¾äÌø×ªµ½ÁË±äÁ¿varµÄ×÷ÓÃÓòÄÚ µ«Êµ¼ÊÉÏÕâ¸öcontinue±êÇ©³öÏÖÔÚ¸Ä´úÂë¿éµÄ×îºóÒ»¸öÓĞĞ§Óï¾äºó
--Òò´Ëgoto²¢Î´Ìø×ª½øÈë±äÁ¿varµÄ×÷ÓÃÓòÄÚ
--gotoÓï¾äÔÚ±àĞ´×´Ì¬»úÊ±Ò²ºÜÓĞÓÃ ¸ø³öÁËÒ»¸öÊÇ·ñ°üº¬Å¼Êı¸ö0µÄ³ÌĞò

::s1:: do
local c=io.read(1)
if c=='0' then goto s2
elseif c==nil then print'ok';return
else goto s1
end
end

::s2:: do
local c=io.read(1)
if c=='0'then goto s1
elseif c==nil then print'not ok';return
else goto s2
end
end
goto s1

--ËäÈ»¿ÉÒÔÊ¹ÓÃ¹ıÄØ¸üºÃµÄ·½Ê½À´±àĞ´Õâ¶Î´úÂë µ«ÉÏÀıÖĞµÄ·½·¨ÓĞÖúÓÚ½«Ò»¸öÓĞÏŞ×Ô¶¯»ú(finite automation)
--×Ô¶¯µØ×ª»¯ÎªluaÓïÑÔ´úÂë(Çë¿¼ÂÇ¶¯Ì¬´úÂëÉú³É(dynamic code generation))
--ÔÙ¾ÙÒ»¸ö¼òµ¥µÄÃÔ¹¬ÓÎÏ·µÄÀı×Ó¡£ÃÔ¹¬ÖĞÓĞ¼¸¸ö·¿¼ä£¬Ã¿¸ö·¿¼äµÄ¶«ÄÏÎ÷±±·½Ïò¸÷ÓĞÒ»ÉÈÃÅ£¬Íæ¼ÒÃ¿´Î¿ÉÒÔÊäÈëÒÆ¶¯µÄ·½Ïò£¬Èç¹ûÔÚÕâ¸ö·½ÏòÉÏÓĞÒ»ÉÈÃÅ
--ÔòÍæ¼Ò¿ÉÒÔ½øÈëÏàÓ¦µÄ·¿¼ä£¬·ñÔò³ÌĞòÊä³öÒ»¸ö¾¯¸æ£¬Íæ¼ÒµÄ×îÖÕÄ¿µÄÊÇ´ÓµÚÒ»¸ö·¿¼ä×ßµ½×îºóÒ»¸ö·¿¼ä
--Õâ¸öÓÎÏ·ÊÇÒ»¸öµäĞÍµÄ×´Ì¬»ú£¬µ±Ç°Íæ¼ÒËøÔÚ·¿¼ä¾ÍÊÇÒ»¸ö×´Ì¬£¬ÎªÊµÏÖÕâ¸öÃÔ¹¬ÓÎÏ·£¬ÎÒÃÇ¿ÉÒÔÎªÃ¿¸ö·¿¼ä¶ÔÓ¦µÄÂß¼­±àĞ´Ò»¶Î´úÂë£¬È»ºóÓÃGotoÓï¾ä±íÊ¾
--´ÓÒ»¸ö·¿¼äÒÆ¶¯µ½ÁíÒ»¸ö·¿¼ä
--ÓÉËÄ¸ö·¿¼ä×é³ÉµÄĞ¡ÃÔ¹¬

goto room1 --ÆğÊ¼·¿¼ä
::room1:: do
local move =io.read()
if move=='south' then goto room3
elseif move=='east' then goto room2
else
print('invalid move')
goto room1
end
end
::room2::do
local move =io.read()
if move=='south' then goto room4
elseif move=='west' then goto room1
else
print("invalid move")
goto room2
end
end

::room3::do
local move=io.read()
if move=='north' then goto room1
elseif move=='east' then goto room4
else
print("invalid move")
goto room3
end
end

::room4:: do
print("congratulations, you won!")
end


--¶ÔÓÚÕâ¸ö¼òµ¥µÄÓÎÏ·£¬¶ÁÕß¿ÉÄÜ»á·¢ÏÖ£¬Ê¹ÓÃÊı¾İÇı¶¯±à³Ì(Ê¹ÓÃ±íÀ´ÃèÊö·¿¼äºÍÒÆ¶¯)ÊÇÒ»ÖÖ¸üºÃµÄÉè¼Æ·½·¨¡£²»¹ı£¬Èç¹ûÓÎÏ·ÖĞµÄÃ¿¼ä·¿¶¼¸÷×Ô²»Í¬£¬ÄÇÃ´¾Í·Ç³£ÊÊºÏ
--Ê¹ÓÃÕâÖÖ×´Ì¬»úµÄÊµÏÖ·½·¨
